In [1]:
# 数据导入
import pandas as pd
df=pd.read_csv('data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [2]:
# 数据的导出
df=df.head() 
df.to_csv('data/new.csv')

In [3]:
# json数据的导入
df=pd.read_json('data/data1.json') # 读取较简单的数据
print(type(df))
print('='*20)


import json
with open('data/test.json') as f:
    data=json.load(f)
print(data['users'])
print('='*20)


print(type(data))
print('='*20)


df=pd.DataFrame(data['users'])
df

<class 'pandas.core.frame.DataFrame'>
====================
[{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]
====================
<class 'dict'>
====================

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

In [4]:
# 缺失值的处理
import numpy as np
import pandas as pd
s=pd.Series([1,2,np.nan,None,pd.NA])
df=pd.DataFrame([[1,pd.NA,2],[2,3,5],[None,4,6]])
print(s)
print('='*20)


# 查看是否是缺失值
print(s.isna()) # isna()
print('='*20)
print(s.isnull()) # isnull()
print('='*20)
print('缺失值个数：',s.isna().sum())
print('='*20)
print(df.isna()) # 与series一致
print('='*20)
print(df.isna().sum())


#

0       1
1       2
2     NaN
3    None
4    <NA>
dtype: object
====================
0    False
1    False
2     True
3     True
4     True
dtype: bool
====================
0    False
1    False
2     True
3     True
4     True
dtype: bool
====================
缺失值个数： 3
====================
       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False
====================
0    1
1    1
2    0
dtype: int64

In [5]:
# 剔除缺失值
print(s.dropna()) # 只剔除缺失值 Series
print('='*20)
print(df.dropna()) # 若有缺失值，直接删除整条数据 DataFrame
print('='*20)
print(df.dropna(how='all')) # 如果所有的值都为缺失值，删除这一行
print('='*20)
print(df.dropna(thresh=2)) # 与参数how不同，在dropna()方法中是看缺失值，而thresh是看有效值。比如thresh=2，只要有效值大于等于这个数，保留数据。相反则删除。同时参数 how 和 thresh 两者不能共存

0    1
1    2
dtype: object
====================
     0  1  2
1  2.0  3  5
====================
     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6
====================
     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

In [6]:
# 填充缺失值
df=pd.read_csv('data/weather_withna.csv')
df.tail()
print(df.isna().sum()) # 找出缺失值总数
print('='*20)


print(df.fillna({'temp_max':25,'temp_min':16,'wind':4}).tail()) # 使用字典填充 # fillna()
print('='*20)


print(df.fillna(df[['wind','temp_max','temp_min']].mean()).tail()) # 使用统计值填充 # fillna()
print('='*20)


print(df.ffill()) # 前向填充(forward fill) df.ffill() 会将缺失值用前一个非缺失值填充，沿着列方向（默认）进行。
print('='*20)


print(df.bfill()) # 后向填充(backward fill) df.bfill() 用下一个非缺失值把 NaN 填掉，默认沿着列方向（axis=0）进行。
print('='*20)

date               0
precipitation    303
temp_max         303
temp_min         303
wind             303
weather          303
dtype: int64
====================
            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN      25.0      16.0   4.0     NaN
1457  2015-12-28            NaN      25.0      16.0   4.0     NaN
1458  2015-12-29            NaN      25.0      16.0   4.0     NaN
1459  2015-12-30            NaN      25.0      16.0   4.0     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
====================
            date  precipitation   temp_max  temp_min      wind weather
1456  2015-12-27            NaN  15.851468  7.877202  3.242055     NaN
1457  2015-12-28            NaN  15.851468  7.877202  3.242055     NaN
1458  2015-12-29            NaN  15.851468  7.877202  3.242055     NaN
1459  2015-12-30            NaN  15.851468  7.877202  3.242055     NaN
1460  2015-12-31           20.6  12.200000  5.000000  3.800000    rain
====================
            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            0.0      11.1       4.4   4.8      sun
1457  2015-12-28            0.0      11.1       4.4   4.8      sun
1458  2015-12-29            0.0      11.1       4.4   4.8      sun
1459  2015-12-30            0.0      11.1       4.4   4.8      sun
1460  2015-12-31           20.6      12.2       5.0   3.8     rain

[1461 rows x 6 columns]
====================
            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27           20.6      12.2       5.0   3.8     rain
1457  2015-12-28           20.6      12.2       5.0   3.8     rain
1458  2015-12-29           20.6      12.2       5.0   3.8     rain
1459  2015-12-30           20.6      12.2       5.0   3.8     rain
1460  2015-12-31           20.6      12.2       5.0   3.8     rain

[1461 rows x 6 columns]
====================

In [7]:
# 数据类型转换 去除重复行
import pandas as pd
data={
    'name':['alice','alice','bob','alice','jack','bob'],
    'age':[26,25,30,25,35,30],
    'city':['NY','NY','LA','NY','SF','LA']
}
df=pd.DataFrame(data)
df

    name  age city
0  alice   26   NY
1  alice   25   NY
2    bob   30   LA
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [8]:
df.duplicated() # 检测重复行
df.drop_duplicates(subset='name') # 去除指定的重复行
df.drop_duplicates(subset='name',keep='last') # 去除指定的重复行，并保留最新的重复数据

    name  age city
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [9]:
# 数据类型的转换
df=pd.read_csv('data/sleep.csv')
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [10]:
df['age']=df['age'].astype('int16') # astype
df['age'].dtypes

dtype('int16')

In [11]:
df=df.astype({'age':'int16','gender':'category'}) # 一次性多次修改
df.dtypes

person_id                     int64
gender                     category
age                           int16
occupation                   object
sleep_duration              float64
sleep_quality               float64
physical_activity_level       int64
stress_level                  int64
bmi_category                 object
blood_pressure               object
heart_rate                    int64
daily_steps                   int64
sleep_disorder               object
dtype: object

In [12]:
df['is_male']=df['gender'].map({'Male':True,'Female':False})
df.is_male.head()

0     True
1    False
2     True
3     True
4     True
Name: is_male, dtype: category
Categories (2, bool): [False, True]

## 数据变形

In [13]:
data={
    'ID':[1,2],
    'name':['alice','bob'],
    'Math':[98,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df.T # 行列转置

             0    1
ID           1    2
name     alice  bob
Math        98   85
English     88   92
Science     95   89

In [14]:
# 宽表转化为长表
df2=pd.melt(df,id_vars=['ID','name'],var_name='科目',value_name='分数')
df2.sort_values('name')

   ID   name       科目  分数
0   1  alice     Math  98
2   1  alice  English  88
4   1  alice  Science  95
1   2    bob     Math  85
3   2    bob  English  92
5   2    bob  Science  89

In [15]:
# 长表转宽表
pd.pivot(df2,index=['ID','name'],columns='科目',values='分数')

科目        English  Math  Science
ID name
1  alice       88    98       95
2  bob         92    85       89

In [16]:
data={
    'ID':[1,2],
    'name':['alice smith','bob smith'],
    'Math':[98,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df

   ID         name  Math  English  Science
0   1  alice smith    98       88       95
1   2    bob smith    85       92       89

In [17]:
# 分列操作
df[['first','last']]=df['name'].str.split(' ',expand=True) # 把要处理的数据当成字符串处理 使用str
df

   ID         name  Math  English  Science  first   last
0   1  alice smith    98       88       95  alice  smith
1   2    bob smith    85       92       89    bob  smith

In [18]:
df=pd.read_csv('data/sleep.csv')
df=df[['person_id','blood_pressure']]
df[['highest','lowest']]=df['blood_pressure'].str.split('/',expand=True)
df['highest']=df['highest'].astype('int64')
df['lowest']=df['lowest'].astype('int64')
df[['highest','lowest']].dtypes # 若有多个值，使用DataFrame格式

highest    int64
lowest     int64
dtype: object

In [19]:
df.highest.mean()

np.float64(122.19)

## 数据分箱 pd.cut(x,bins,labels)

In [20]:
import pandas as pd
df=pd.read_csv('data/employees.csv')
df.head(10)

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,IT_PROG,4800.0,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,IT_PROG,4800.0,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,IT_PROG,4200.0,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,FI_MGR,12000.0,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,FI_ACCOUNT,9000.0,NaN,108.0,100.0

In [21]:
df1=df.head(10)[['employee_id','salary']]
pd.cut(df1['salary'],bins=2) # bins 自动等宽分 起始值，结束值分别时所有值的最小值和最大值
pd.cut(df1['salary'],bins=3).value_counts()

salary
(4180.2, 10800.0]     6
(10800.0, 17400.0]    3
(17400.0, 24000.0]    1
Name: count, dtype: int64

In [22]:
pd.cut(df1['salary'],bins=[0,10000,20000,30000]) # bins用列表自定义分割

0    (20000, 30000]
1    (10000, 20000]
2    (10000, 20000]
3        (0, 10000]
4        (0, 10000]
5        (0, 10000]
6        (0, 10000]
7        (0, 10000]
8    (10000, 20000]
9        (0, 10000]
Name: salary, dtype: category
Categories (3, interval[int64, right]): [(0, 10000] < (10000, 20000] < (20000, 30000]]

In [23]:
pd.cut(df1['salary'],bins=[0,10000,20000,30000]).value_counts()

salary
(0, 10000]        6
(10000, 20000]    3
(20000, 30000]    1
Name: count, dtype: int64

In [24]:
df1['收入水平']=pd.cut(df1['salary'],
                   bins=[0,10000,20000,30000],
                   labels=['低','中','高'])
df1

   employee_id   salary 收入水平
0          100  24000.0    高
1          101  17000.0    中
2          102  17000.0    中
3          103   9000.0    低
4          104   6000.0    低
5          105   4800.0    低
6          106   4800.0    低
7          107   4200.0    低
8          108  12000.0    中
9          109   9000.0    低

In [25]:
pd.qcut(df1['salary'],3).value_counts() # 等频或分位数划分

salary
(12000.0, 24000.0]    4
(4199.999, 6000.0]    3
(6000.0, 12000.0]     3
Name: count, dtype: int64

In [26]:
# 睡眠数据
df=pd.read_csv('data/sleep.csv')
df.head(10)

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,sleep_disorder
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,NaN
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,NaN
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,NaN
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,NaN
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,Insomnia
5,6,Female,47,Student,6.1,6.9,24,4,Normal,123/60,87,9485,NaN
6,7,Male,22,Office Worker,5.1,6.1,26,6,Obese,121/70,66,15680,NaN
7,8,Male,49,Office Worker,10.7,6.2,49,8,Obese,134/87,59,18767,NaN
8,9,Male,25,Manual Labor,11.9,7.2,27,8,Underweight,112/63,99,16397,Sleep Apnea
9,10,Female,51,Retired,8.2,4.0,64,5,Overweight,125/84,76,12744,NaN

In [27]:
df1=df.head(10)[['person_id','sleep_quality']]
df1['睡眠质量']=pd.cut(df1['sleep_quality'],
           bins=3,
           labels=['差','良','优'])

df1['睡眠质量'].value_counts()

睡眠质量
良    5
差    3
优    2
Name: count, dtype: int64

In [28]:
# df.rename() df.set_index() df.reset_index()
df=pd.DataFrame({
    'name':['xx','jk','qq','jj','kk'],
    'age':[20,23,25,23,24],
    'gender':['male','female','male','male','female']
})
df.set_index('name',inplace=True) # 设置索引 inplace=True 修改原数据
df.reset_index(inplace=True)
df.rename(columns={'age':'年龄'},index={0:9})

  name  年龄  gender
9   xx  20    male
1   jk  23  female
2   qq  25    male
3   jj  23    male
4   kk  24  female

In [41]:
# 时间数据的处理
import pandas as pd
d=pd.Timestamp('2025-12-19 15:43') # 时间戳——把某个时刻换算成一串数字，方便存储、比较、计算。
print(d)
print(type(d))
print('年',d.year,'月',d.month,'日',d.day,'季度',d.quarter)
print('是否是月底',d.is_month_end)

# 方法
print('周几：',d.day_name()) # 获取当前日期是周几
print('转化为天：',d.to_period('D'))

2025-12-19 15:43:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
年 2025 月 12 日 19 季度 4
是否是月底 False
周几： Friday
转化为天： 2025-12-19

In [44]:
#  字符串转化为日期类型
a=pd.to_datetime('2025-12-19') # pd.to_datrtime()
print(a)
print(type(a))

2025-12-19 00:00:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [61]:
# dataframe 日期转换
df=pd.DataFrame({
    'sales':[200,300,400],
    'date':['20251201','20251202','20251203']
})
df['datetime']=pd.to_datetime(df['date'])
print(df.info())
print('='*20)


df['week']=df['datetime'].dt.day_name()


df['datetime'].dt.year

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sales     3 non-null      int64
 1   date      3 non-null      object
 2   datetime  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 204.0+ bytes
None
====================

0    2025
1    2025
2    2025
Name: datetime, dtype: int32

In [99]:
# csv 日期转换
df=pd.read_csv('data/weather.csv',parse_dates=['date']) # 
df['date'].dt.day_name().head()

0       Sunday
1       Monday
2      Tuesday
3    Wednesday
4     Thursday
Name: date, dtype: object

In [100]:
# 日期数据作为索引
df.set_index('date',inplace=True)
df.loc['2013-01':'2013-02'].head() # 切片

            precipitation  temp_max  temp_min  wind weather
date
2013-01-01            0.0       5.0      -2.8   2.7     sun
2013-01-02            0.0       6.1      -1.1   3.2     sun
2013-01-03            4.1       6.7      -1.7   3.0    rain
2013-01-04            2.5      10.0       2.2   2.8    rain
2013-01-05            3.0       6.7       4.4   3.1    rain

In [106]:
# 时间间隔
d1=pd.Timestamp('20200101')
d2=pd.Timestamp('20210101')
d3=d2-d1
print(d3)
print(type(d3))

366 days 00:00:00
<class 'pandas._libs.tslibs.timedeltas.Timedelta'>

In [115]:
df=pd.read_csv('data/weather.csv',parse_dates=['date'])
df.info()
df['delta']=df['date']-df['date'][0]
df.set_index('delta',inplace=True)
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1461 non-null   datetime64[ns]
 1   precipitation  1461 non-null   float64
 2   temp_max       1461 non-null   float64
 3   temp_min       1461 non-null   float64
 4   wind           1461 non-null   float64
 5   weather        1461 non-null   object
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 68.6+ KB

                date  precipitation  temp_max  temp_min  wind  weather
delta
0 days    2012-01-01            0.0      12.8       5.0   4.7  drizzle
1 days    2012-01-02           10.9      10.6       2.8   4.5     rain
2 days    2012-01-03            0.8      11.7       7.2   2.3     rain
3 days    2012-01-04           20.3      12.2       5.6   4.7     rain
4 days    2012-01-05            1.3       8.9       2.8   6.1     rain
...              ...            ...       ...       ...   ...      ...
1456 days 2015-12-27            8.6       4.4       1.7   2.9     rain
1457 days 2015-12-28            1.5       5.0       1.7   1.3     rain
1458 days 2015-12-29            0.0       7.2       0.6   2.6      fog
1459 days 2015-12-30            0.0       5.6      -1.0   3.4      sun
1460 days 2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [117]:
df.loc['10 days':'20 days']

              date  precipitation  temp_max  temp_min  wind weather
delta
10 days 2012-01-11            0.0       6.1      -1.1   5.1     sun
11 days 2012-01-12            0.0       6.1      -1.7   1.9     sun
12 days 2012-01-13            0.0       5.0      -2.8   1.3     sun
13 days 2012-01-14            4.1       4.4       0.6   5.3    snow
14 days 2012-01-15            5.3       1.1      -3.3   3.2    snow
15 days 2012-01-16            2.5       1.7      -2.8   5.0    snow
16 days 2012-01-17            8.1       3.3       0.0   5.6    snow
17 days 2012-01-18           19.8       0.0      -2.8   5.0    snow
18 days 2012-01-19           15.2      -1.1      -2.8   1.6    snow
19 days 2012-01-20           13.5       7.2      -1.1   2.3    snow
20 days 2012-01-21            3.0       8.3       3.3   8.2    rain

In [126]:
df=pd.read_csv('data/weather.csv',parse_dates=['date']) # 读取文件，并将文件里的date的数据类型设置为datetime
# 重采样
df.set_index('date',inplace=True) # 将date设置为索引
df[['temp_max','temp_min']].resample('YE').mean()

             temp_max  temp_min
date
2012-12-31  15.276776  7.289617
2013-12-31  16.058904  8.153973
2014-12-31  16.995890  8.662466
2015-12-31  17.427945  8.835616

## 分组聚合

In [147]:
# df.groupby('分组的字段')['聚合的字段'].聚合函数
import pandas as pd
df=pd.read_csv('data/employees.csv')
print(df['department_id'].isna().sum()) # 找出缺失值总数
df=df.dropna(subset=['department_id']) # 由于缺失值只有一个，选择直接删除，对结果影响不大
df['department_id']=df['department_id'].astype('int64')
df

1

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110

In [154]:
# 计算不同部门的平均薪资
df.groupby('department_id').groups # 查看分组的情况 字典类型 索引号
df.groupby('department_id').get_group(110) # 查看具体某个分组数据

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110

In [167]:
df2=df.groupby('department_id')[['salary']].mean().round(2)
df2.sort_values('salary',ascending=False)

                 salary
department_id
90             19333.33
110            10150.00
70             10000.00
20              9500.00
80              8955.88
100             8600.00
40              6500.00
60              5760.00
10              4400.00
30              4150.00
50              3475.56

In [178]:
# 计算不同部门不同岗位的平均工资
df2=df.groupby(['department_id','job_id'])[['salary']].mean().round(2)
df2=df2.reset_index()
df2.sort_values('salary',ascending=False)

    department_id      job_id    salary
13             90     AD_PRES  24000.00
14             90       AD_VP  17000.00
1              20      MK_MAN  13000.00
11             80      SA_MAN  12200.00
16            100      FI_MGR  12000.00
18            110      AC_MGR  12000.00
4              30      PU_MAN  11000.00
10             70      PR_REP  10000.00
12             80      SA_REP   8396.55
17            110  AC_ACCOUNT   8300.00
15            100  FI_ACCOUNT   7920.00
8              50      ST_MAN   7280.00
5              40      HR_REP   6500.00
2              20      MK_REP   6000.00
9              60     IT_PROG   5760.00
0              10     AD_ASST   4400.00
6              50    SH_CLERK   3215.00
7              50    ST_CLERK   2785.00
3              30    PU_CLERK   2780.00

## 企鹅数据分析

In [202]:
# 1.导入相关库

import pandas as pd
import numpy as np
# 2.导入数据

df=pd.read_csv('data/penguins.csv')
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [203]:
# 3.数据清洗 缺失值，重复值，数据类型的转换
print(df.isna().sum()) # 查看缺失值总数
df.dropna(inplace=True) # 去除缺失值，并直接在原表上操作

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [204]:
# 4.数据特征的构造
df['sex']=df['sex'].astype('category')
df['bill_ratio']=(df['bill_length_mm']/df['bill_depth_mm']).round(3) # 构建一个比值
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,bill_ratio
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,2.091
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,2.270
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,2.239
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,1.902
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male,1.908
...,...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,Female,3.445
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female,3.273
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male,3.210
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female,3.054
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male,3.099

In [208]:
# 5.数据分析
# 数据分箱 把体重分为三个等级
df['体重等级']=pd.cut(df['body_mass_g'],3,labels=['低','中','高'])
df['体重等级'].value_counts()

体重等级
低    150
中    128
高     55
Name: count, dtype: int64

In [218]:
# 按性别分析
df.groupby(['sex','island'],observed=False).agg({
    'body_mass_g':['mean','count']
})

                  body_mass_g
                         mean count
sex    island
Female Biscoe     4319.375000    80
       Dream      3446.311475    61
       Torgersen  3395.833333    24
Male   Biscoe     5104.518072    83
       Dream      3987.096774    62
       Torgersen  4034.782609    23

## 睡眠质量分析

In [288]:
import pandas as pd
import numpy as np

df=pd.read_csv('data/sleep.csv')
df.head()

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,sleep_disorder
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,NaN
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,NaN
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,NaN
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,NaN
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,Insomnia

In [289]:
df.drop(columns='sleep_disorder',inplace=True)
df.head()

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945

In [308]:
# 数据特征的构造
df['gender']=df['gender'].astype('category')
df['occupation']=df['occupation'].astype('category')
df['bmi_category']=df['bmi_category'].astype('category')
df[['high','low']]=df['blood_pressure'].str.split('/',expand=True)

#  对睡眠质量进行分箱
df['quality_level']=pd.cut(df['sleep_quality'],
                           3,
                           labels=['差','良','优'])


# 对年龄层次分箱
df['age_level']=pd.cut(df['age'],
                       3,
                       labels=['青年','中年','老年'])

df

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,high,low,quality_level,age_level
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,124,70,良,青年
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,131,86,良,中年
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,122,70,良,中年
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,124,72,优,青年
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,133,78,优,老年
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,396,Female,36,Student,4.5,7.9,73,7,Normal,118/66,64,14497,118,66,优,青年
396,397,Female,45,Manual Labor,6.0,6.1,72,8,Obese,132/80,65,12848,132,80,良,中年
397,398,Female,30,Student,5.3,6.5,58,10,Obese,125/76,66,15255,125,76,良,青年
398,399,Female,41,Retired,11.0,9.1,73,9,Obese,130/75,75,6567,130,75,优,青年
399,400,Male,37,Retired,5.8,7.0,41,6,Normal,118/70,51,18079,118,70,良,青年

In [ ]:
# 数据的统计
# 根据不同的bmi分组
df.groupby(['age_level','bmi_category'],observed=True).agg({
    'sleep_duration':'mean',
    'sleep_quality':'mean',
    'stress_level':'mean'
}).round(3)

                        sleep_duration  sleep_quality  stress_level
age_level bmi_category
青年        Normal                 8.100          6.332         4.860
          Obese                  8.250          6.253         5.534
          Overweight             8.214          6.171         5.317
          Underweight            7.603          5.884         5.426
中年        Normal                 7.422          6.650         4.944
          Obese                  7.806          6.217         5.889
          Overweight             8.246          5.956         5.974
          Underweight            8.497          5.908         5.750
老年        Normal                 7.420          4.240         4.200
          Obese                  7.900          5.025         8.000
          Overweight             8.971          6.286         6.714
          Underweight           10.500          6.200         6.000